       01  PERSON.
           05  ID                      PIC X(12).
           05  FIRST-NAME              PIC X(32).
           05  LAST-NAME               PIC X(32).
           05  MIDDLE-INITIAL          PIC X(1).
           05  AGE                     PIC 9(3).
           05  SEX                     PIC X(1).
           05  DATE-OF-BIRTH           PIC X(10).
           05  HOME-PHONE.
               10  NUMBER              PIC X(12).
           05  WORK-PHONE.
               10  NUMBER              PIC X(12).
